# Built In Failures Slab Shape Failures Slab Shape Cannot Paste Subpicks In Other Doc Property

Source: https://www.revitapidocs.com/2026/2d5f24d1-93b7-2d66-7b2b-7d86be8f08d5.htm

---

| Built In Failures Slab Shape Failures Slab Shape Cannot Paste Subpicks In Other Doc Property |
| --- |

Cannot paste points or lines into another project. Paste points or lines into the original project only.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId SlabShapeCannotPasteSubpicksInOtherDoc { get; }
```

```
Public Shared ReadOnly Property SlabShapeCannotPasteSubpicksInOtherDoc As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ SlabShapeCannotPasteSubpicksInOtherDoc {
	FailureDefinitionId^ get ();
}
```

```
static member SlabShapeCannotPasteSubpicksInOtherDoc : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures SlabShapeFailures Class Autodesk.Revit.DB Namespace